---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsVerticalHeaders
source: html/81aa76f2-38cb-afc3-8ddc-991affadcde7.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SummaryShowsVerticalHeaders Property

Shows text in the Load Summary section's headers vertically instead of horizontally

## Syntax (C#)
```csharp
public bool SummaryShowsVerticalHeaders { get; }
```

## Remarks
Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)